#include "pkgs.h"

#include <iostream>
#include <vector>

int main() {
    // 创建一个 path
    std::vector<int> path = {1, 2, 3, 4, 5};

    // 创建一个 res_path 容器，包含一个空的 vector
    std::vector<std::vector<int>> res_path;

    // 将 path 复制到 res_path
    res_path.push_back(path);

    // 打印 res_path 中的第一个元素
    std::cout << "Before modifying path:" << std::endl;
    for (int num : res_path[0]) {
        std::cout << num << " ";
    }
    std::cout << std::endl;

    // 修改 path
    path[0] = 10;
    path[1] = 20;

    res_path[0] = path; 

    path[0] = 1;

    // 打印 path 和 res_path 中的第一个元素
    std::cout << "After modifying path:" << std::endl;
    std::cout << "path: ";
    for (int num : path) {
        std::cout << num << " ";
    }
    std::cout << std::endl;

    std::cout << "res_path[0]: ";
    for (int num : res_path[0]) {
        std::cout << num << " ";
    }
    std::cout << std::endl;

    return 0;
}



/**
1398. 购买了产品 A 和产品 B 却没有购买产品 C 的顾客
66.7%
中等

1. 两数之和
54.9%
简单

1920. 基于排列构建数组
86.7%
简单

989. 数组形式的整数加法
45.0%
简单

10. 正则表达式匹配
30.9%
困难

523. 连续的子数组和
29.2%
中等

13. 罗马数字转整数 !!!
64.1%
简单

525. 连续数组
55.0%
中等

15. 三数之和
39.3%
中等

998. 最大二叉树 II
69.6%
中等

17. 电话号码的字母组合
61.9%
中等

1439. 有序矩阵中的第 k 个最小数组和
66.3%
困难

1443. 收集树上所有苹果的最少时间
45.6%
中等

20. 有效的括号
44.7%
简单

1460. 通过翻转子数组使两个数组相等
77.3%
简单

1004. 最大连续1的个数 III
60.6%
中等

23. 合并 K 个升序链表
61.8%
困难

535. TinyURL 的加密与解密
87.4%
中等

25. K 个一组翻转链表
69.3%
困难

26. 删除有序数组中的重复项
57.9%
简单

1453. 圆形靶内的最大飞镖数量
38.7%
困难

28. 找出字符串中第一个匹配项的下标
44.8%
简单

1947. 最大兼容性评分和 !!!
62.4%
中等

543. 二叉树的直径
62.6%
简单

33. 搜索旋转排序数组
45.1%
中等

38. 外观数列
61.4%
中等

554. 砖墙
52.5%
中等

43. 字符串相乘
44.6%
中等

44. 通配符匹配 !!!
34.3%
困难

1445. 苹果和桔子
81.0%
中等

1976. 到达目的地的方案数
45.7%
中等

49. 字母异位词分组
69.8%
中等

50. Pow(x, n)
38.8%
中等

1949. 坚定的友谊
53.1%
中等

56. 合并区间
51.4%
中等

57. 插入区间
42.7%
中等

572. 另一棵树的子树
48.9%
简单

578. 查询回答率最高的问题
41.8%
中等

67. 二进制求和
53.8%
简单

68. 文本左右对齐
56.2%
困难

69. x 的平方根
38.7%
简单

71. 简化路径
47.1%
中等

75. 颜色分类 !!!
62.4%
中等

76. 最小覆盖子串
47.4%
困难

78. 子集
82.2%
中等

79. 单词搜索 !!!
48.8%
中等

80. 删除有序数组中的重复项 II
63.4%
中等

1033. 移动石子直到连续 !!!
50.6%
中等

1973. 值等于子节点值之和的节点数量
63.2%
中等

2553. 分割数组中数字的数位
79.3%
简单

85. 最大矩形 !!!
55.7%
困难

597. 好友申请 I：总体通过率 !!!
42.8%
简单

88. 合并两个有序数组
54.8%
简单

1040. 移动石子直到连续 II
65.9%
中等

90. 子集 II
64.0%
中等

91. 解码方法
34.4%
中等

602. 好友申请 II ：谁有最多的好友
62.2%
中等

2014. 重复 K 次的最长子序列 !!!
54.9%
困难

1043. 分隔数组以得到最大和
75.6%
中等

98. 验证二叉搜索树
39.2%
中等

102. 二叉树的层序遍历
69.5%
中等

2596. 检查骑士巡视方案
57.7%
中等

621. 任务调度器
60.4%
中等

117. 填充每个节点的下一个右侧节点指针 II
71.6%
中等

121. 买卖股票的最佳时机
58.6%
简单

636. 函数的独占时间
66.4%
中等

125. 验证回文串
48.1%
简单

637. 二叉树的层平均值
71.8%
简单

127. 单词接龙
49.6%
困难

128. 最长连续序列
50.3%
中等

639. 解码方法 II
36.1%
困难

642. 设计搜索自动补全系统
56.1%
困难

1213. 三个有序数组的交集
78.5%
简单

1522. N 叉树的直径
73.2%
中等

133. 克隆图
72.9%
中等

647. 回文子串
67.9%
中等

1075. 项目员工 I
64.4%
简单

1076. 项目员工II
49.5%
简单

139. 单词拆分
58.0%
中等

1077. 项目员工 III
72.0%
中等

653. 两数之和 IV - 输入二叉搜索树
63.6%
简单

146. LRU 缓存
54.5%
中等

1216. 验证回文串 III
56.9%
困难

157. 用 Read4 读取 N 个字符
55.6%
简单

158. 用 Read4 读取 N 个字符 II - 多次调用
57.4%
困难

670. 最大交换
49.2%
中等

161. 相隔为 1 的编辑距离
34.4%
中等

673. 最长递增子序列的个数
45.4%
中等

674. 最长连续递增序列
58.8%
简单

168. Excel 表列名称
45.4%
简单

680. 验证回文串 II
41.4%
简单

173. 二叉搜索树迭代器
82.7%
中等

689. 三个无重叠子数组的最大和
58.4%
困难

1570. 两个稀疏向量的点积
87.9%
中等

1108. IP 地址无效化
85.3%
简单

1113. 报告的记录
54.2%
简单

1586. 二叉搜索树迭代器 II
54.6%
中等

1123. 最深叶节点的最近公共祖先
79.1%
中等

200. 岛屿数量
62.6%
中等

714. 买卖股票的最佳时机含手续费
77.2%
中等

206. 反转链表
75.8%
简单

208. 实现 Trie (前缀树)
72.7%
中等

209. 长度最小的子数组
47.1%
中等

210. 课程表 II
58.9%
中等

211. 添加与搜索单词 - 数据结构设计
50.8%
中等

721. 账户合并
51.5%
中等

1132. 报告的记录 II
37.6%
中等

215. 数组中的第K个最大元素
60.8%
中等

218. 天际线问题
55.7%
困难

221. 最大正方形
51.3%
中等

1141. 查询近30天活跃用户数
46.4%
简单

1142. 过去30天的用户活动 II
36.6%
简单

234. 回文链表
56.5%
简单

235. 二叉搜索树的最近公共祖先
71.7%
中等

236. 二叉树的最近公共祖先
73.4%
中等

745. 前缀和后缀搜索
43.8%
困难

238. 除自身以外数组的乘积
77.5%
中等

750. 角矩形的数量
71.8%
中等

1662. 检查两个字符串数组是否相等
80.8%
简单

426. 将二叉搜索树转化为排序的双向链表
67.9%
中等

1236. 网络爬虫
58.3%
中等

1361. 验证二叉树
39.9%
中等

252. 会议室
59.0%
简单

253. 会议室 II
52.9%
中等

1650. 二叉树的最近公共祖先 III
82.9%
中等

257. 二叉树的所有路径
71.5%
简单

764. 最大加号标志
54.3%
中等

261. 以图判树
51.6%
中等

265. 粉刷房子 II
65.4%
困难

1661. 每台机器的进程平均运行时间
71.7%
简单

268. 丢失的数字
67.8%
简单

269. 火星词典
37.7%
困难

2210. 统计数组中峰和谷的数量
59.6%
简单

273. 整数转换英文表示
36.8%
困难

274. H 指数
46.3%
中等

275. H 指数 II
44.7%
中等

277. 搜寻名人
58.8%
中等

278. 第一个错误的版本
45.9%
简单

703. 数据流中的第 K 大元素
53.0%
简单

282. 给表达式添加运算符
46.7%
困难

283. 移动零
64.0%
简单

1718. 构建字典序最大的可行序列
53.2%
中等

285. 二叉搜索树中的中序后继
65.1%
中等

286. 墙与门
56.3%
中等

2199. 找到每篇文章的主题
58.1%
困难

784. 字母大小写全排列
72.9%
中等

785. 判断二分图
55.9%
中等

297. 二叉树的序列化与反序列化
59.7%
困难

2265. 统计值等于子树平均值的节点数
83.2%
中等

301. 删除无效的括号
55.7%
困难

801. 使序列递增的最小交换次数
51.0%
困难

311. 稀疏矩阵的乘法
75.8%
中等

1748. 唯一元素的和
76.0%
简单

314. 二叉树的垂直遍历
57.1%
中等

1211. 查询结果的质量和占比
52.0%
简单

325. 和等于 k 的最长子数组长度
52.2%
中等

2289. 使数组按非递减顺序排列
24.7%
中等

1225. 报告系统状态的连续日期
51.8%
困难

334. 递增的三元子序列
42.8%
中等

824. 山羊拉丁文
65.4%
简单

825. 适龄的朋友
47.2%
中等

341. 扁平化嵌套列表迭代器
72.8%
中等

1242. 多线程网页爬虫
49.5%
中等

1249. 移除无效的括号
60.5%
中等

1428. 至少有一个 1 的最左端列
63.5%
中等

489. 扫地机器人
65.7%
困难

1241. 每个帖子的评论数
59.6%
简单

2824. 统计和小于目标的下标对数目
85.4%
简单

2303. 计算应缴税款总额
70.5%
简单

1773. 统计匹配检索规则的物品数量
86.1%
简单

1757. 可回收且低脂的产品
85.3%
简单

1762. 能看到海景的建筑物
72.0%
中等

1264. 页面推荐
55.8%
中等

377. 组合总和 Ⅳ
53.8%
中等

1790. 仅执行一次字符串交换能否使两个字符串相等
52.6%
简单

380. O(1) 时间插入、删除和获取随机元素
52.6%
中等

865. 具有所有最深节点的最小子树
72.4%
中等

394. 字符串解码
59.6%
中等

1778. 未知网格中的最短路径
46.7%
中等

398. 随机数索引
68.5%
中等

404. 左叶子之和
63.8%
简单

410. 分割数组的最大值
60.7%
困难

893. 特殊等价字符串组
74.0%
中等

896. 单调数列
56.6%
简单

1810. 隐藏网格下的最小消耗路径
61.0%
中等

1322. 广告效果
59.8%
简单

1357. 每隔 n 个顾客打折
56.0%
中等

2365. 任务调度器 II
49.2%
中等

1826. 有缺陷的传感器
41.9%
简单

461. 汉明距离
82.0%
简单

938. 二叉搜索树的范围和
83.4%
简单

1379. 找出克隆二叉树中的相同节点
85.6%
简单

477. 汉明距离总和
61.1%
中等

953. 验证外星语词典
57.7%
简单

1868. 两个行程编码数组的积
48.4%
中等

958. 二叉树的完全性检验
55.7%
中等

494. 目标和
48.6%
中等

968. 监控二叉树
52.8%
困难

973. 最接近原点的 K 个点
65.6%
中等

2452. 距离字典两次编辑以内的单词
65.6%
中等

1928. 规定时间内到达终点的最小花费
54.6%
困难

977. 有序数组的平方
69.0%
简单

1892. 页面推荐Ⅱ
39.0%
困难

197. 上升的温度
54.2%
简单

5. 最长回文子串
39.4%
中等

7. 整数反转
35.6%
中等

202. 快乐数
65.7%
简单

21. 合并两个有序链表
67.7%
简单

3095. 或值至少 K 的最短子数组 I
58.9%
简单


 */

 

 /**
  * 
Where is the team primarily based?

What is the level distribution in our team? 

What about start date? 

Do we ramp up plan? 
  */